Revit 2026 API

# FilteredElementCollectorContainedInDesignOption Method

---

Applies an ElementDesignOptionFilter to the collector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredElementCollector ContainedInDesignOption(
	ElementId designOptionId
)
```
```vb
Public Function ContainedInDesignOption (
	designOptionId As ElementId
) As FilteredElementCollector
```
```cpp
public:
FilteredElementCollector^ ContainedInDesignOption(
	ElementId^ designOptionId
)
```
```fsharp
member ContainedInDesignOption :
        designOptionId : ElementId -> FilteredElementCollector
```

#### Parameters

designOptionId ElementId
     The design option id.

#### Return Value

FilteredElementCollector A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Only elements that are contained by this particular design option will pass the collector. If you have an active iterator to this collector it will be stopped by this call.

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace